; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v9)
             (pred_6 ?v11 ?v6)
             (pred_1 ?v4 ?v6)
             (pred_2 ?v3 ?v4 )
	     (pred_3 ?v4)
             (pred_11 ?v2)
             (pred_8 ?v11)
             (pred_5 ?v6)
             (pred_7 ?v4)
             (pred_12 ?v11)
             (pred_4 ?v4)
             (pred_9 ))



(:action op_5
:parameters (?v13 ?v8 ?v5 ?v7)
:precondition (and (pred_11 ?v13) (pred_11 ?v8) (pred_8 ?v5) (pred_5 ?v7)
          (pred_10 ?v13 ?v8) (pred_6 ?v5 ?v7)
                   (pred_1 ?v8 ?v7) (pred_3 ?v13) 
                   (pred_7 ?v8) (pred_12 ?v5))
:effect (and  (pred_4 ?v8) (not (pred_7 ?v8))))


(:action op_4
:parameters (?v13 ?v12)
:precondition (and (pred_11 ?v13) (pred_11 ?v12)
               (pred_3 ?v13) (pred_10 ?v13 ?v12) (pred_4 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v13))))

(:action op_2
:parameters (?v13 ?v5)
:precondition (and (pred_11 ?v13) (pred_8 ?v5) 
                  (pred_3 ?v13) (pred_2 ?v5 ?v13) (pred_9 ))
:effect (and (pred_12 ?v5)
   (not (pred_2 ?v5 ?v13)) (not (pred_9 ))))


(:action op_3
:parameters (?v13 ?v10 ?v1)
:precondition (and (pred_11 ?v13) (pred_8 ?v10) (pred_8 ?v1)
                  (pred_3 ?v13) (pred_12 ?v1) (pred_2 ?v10 ?v13))
:effect (and (pred_12 ?v10) (pred_2 ?v1 ?v13)
        (not (pred_12 ?v1)) (not (pred_2 ?v10 ?v13))))

(:action op_1
:parameters (?v13 ?v5)
:precondition (and (pred_11 ?v13) (pred_8 ?v5) 
                  (pred_3 ?v13) (pred_12 ?v5))
:effect (and (pred_9 ) (pred_2 ?v5 ?v13) (not (pred_12 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_28 obj_09 obj_19 obj_18 obj_27 obj_16 obj_08 obj_13 obj_20 obj_25 obj_17 obj_12 obj_10 obj_21 obj_14 obj_07 obj_15 obj_01 obj_30 obj_05 obj_24 obj_26 obj_02 obj_03
    obj_29 obj_04
    obj_11 obj_06 obj_22
    )

    (:init
       (pred_9)

       (pred_11 obj_23)
       (pred_11 obj_28)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_16)
       (pred_11 obj_08)
       (pred_11 obj_13)
       (pred_11 obj_20)
       (pred_11 obj_25)
       (pred_11 obj_17)
       (pred_11 obj_12)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_14)
       (pred_11 obj_07)
       (pred_11 obj_15)
       (pred_11 obj_01)
       (pred_11 obj_30)
       (pred_11 obj_05)
       (pred_11 obj_24)
       (pred_11 obj_26)
       (pred_11 obj_02)
       (pred_11 obj_03)
       (pred_5 obj_29)
       (pred_5 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_8 obj_22)

       (pred_10 obj_23 obj_27)
       (pred_10 obj_23 obj_28)
       (pred_10 obj_28 obj_16)
       (pred_10 obj_28 obj_09)
       (pred_10 obj_28 obj_23)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_28)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_27 obj_25)
       (pred_10 obj_27 obj_16)
       (pred_10 obj_27 obj_23)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_16 obj_28)
       (pred_10 obj_16 obj_27)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_25 obj_14)
       (pred_10 obj_25 obj_17)
       (pred_10 obj_25 obj_27)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_17 obj_25)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_10)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_21 obj_20)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_14 obj_05)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_25)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_07 obj_15)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_15 obj_26)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_07)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_30)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_30 obj_03)
       (pred_10 obj_30 obj_21)
       (pred_10 obj_30 obj_01)
       (pred_10 obj_05 obj_24)
       (pred_10 obj_05 obj_14)
       (pred_10 obj_24 obj_26)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_24 obj_05)
       (pred_10 obj_26 obj_02)
       (pred_10 obj_26 obj_15)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_26)
       (pred_10 obj_03 obj_30)
       (pred_10 obj_03 obj_02)
       (pred_7 obj_28)
       (pred_7 obj_19)
       (pred_7 obj_30)
       (pred_1  obj_28 obj_29)
       (pred_1  obj_19 obj_04)
       (pred_1  obj_30 obj_04)
       (pred_4 obj_23)
       (pred_4 obj_09)
       (pred_4 obj_18)
       (pred_4 obj_27)
       (pred_4 obj_16)
       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_25)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_15)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_24)
       (pred_4 obj_26)
       (pred_4 obj_02)
       (pred_4 obj_03)

       (pred_6  obj_11 obj_29)
       (pred_6  obj_06 obj_04)
       (pred_6  obj_22 obj_04)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_06 obj_25)
       (pred_2 obj_22 obj_08)
       (pred_3 obj_12)
    )

    (:goal (and
       (pred_2 obj_11 obj_24)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_22 obj_16)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_4 obj_12 obj_08)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_08)
   goals met: 0 of 3
2. (op_2 obj_08 obj_22)
   deleted: (pred_2 obj_22 obj_08) (pred_9)
   added: (pred_12 obj_22)
   goals met: 0 of 3
3. (op_4 obj_08 obj_16)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_16)
   goals met: 0 of 3
4. (op_1 obj_16 obj_22)
   deleted: (pred_12 obj_22)
   added: (pred_9) (pred_2 obj_22 obj_16)
   goals met: 1 of 3
5. (op_4 obj_16 obj_17)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_17)
   goals met: 1 of 3
6. (op_4 obj_17 obj_25)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_25)
   goals met: 1 of 3
7. (op_2 obj_25 obj_06)
   deleted: (pred_2 obj_06 obj_25) (pred_9)
   added: (pred_12 obj_06)
   goals met: 1 of 3
8. (op_4 obj_25 obj_17)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_17)
   goals met: 1 of 3
9. (op_4 obj_17 obj_16)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_16)
   goals met: 1 of 3
10. (op_4 obj_16 obj_08)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_08)
   goals met: 1 of 3
11. (op_4 obj_08 obj_09)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_09)
   goals met: 1 of 3
12. (op_1 obj_09 obj_06)
   deleted: (pred_12 obj_06)
   added: (pred_9) (pred_2 obj_06 obj_09)
   goals met: 2 of 3
13. (op_4 obj_09 obj_08)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_08)
   goals met: 2 of 3
14. (op_4 obj_08 obj_12)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_12)
   goals met: 2 of 3
15. (op_4 obj_12 obj_10)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_10)
   goals met: 2 of 3
16. (op_4 obj_10 obj_21)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_21)
   goals met: 2 of 3
17. (op_4 obj_21 obj_20)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_20)
   goals met: 2 of 3
18. (op_2 obj_20 obj_11)
   deleted: (pred_2 obj_11 obj_20) (pred_9)
   added: (pred_12 obj_11)
   goals met: 2 of 3
19. (op_4 obj_20 obj_21)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_21)
   goals met: 2 of 3
20. (op_4 obj_21 obj_10)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_10)
   goals met: 2 of 3
21. (op_4 obj_10 obj_12)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_12)
   goals met: 2 of 3
22. (op_4 obj_12 obj_17)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_17)
   goals met: 2 of 3
23. (op_4 obj_17 obj_07)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_07)
   goals met: 2 of 3
24. (op_4 obj_07 obj_24)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_24)
   goals met: 2 of 3
25. (op_1 obj_24 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_9) (pred_2 obj_11 obj_24)
   goals met: 3 of 3
